In [1]:
import pandas as pd

In [2]:
list1=[2,4,6,78,11,22,98]

In [3]:
ser1=pd.Series(list1)

In [4]:
ser1

0     2
1     4
2     6
3    78
4    11
5    22
6    98
dtype: int64

In [5]:
list2=['sabeeda','nandu','hasiib','anil']

In [6]:
ser2=pd.Series(list2)

In [7]:
ser2

0    sabeeda
1      nandu
2     hasiib
3       anil
dtype: object

In [8]:
import numpy as np

In [9]:
a=np.arange(1,100,5)

In [10]:
ser3=pd.Series(a)

In [11]:
ser3

0      1
1      6
2     11
3     16
4     21
5     26
6     31
7     36
8     41
9     46
10    51
11    56
12    61
13    66
14    71
15    76
16    81
17    86
18    91
19    96
dtype: int32

In [12]:
ser2

0    sabeeda
1      nandu
2     hasiib
3       anil
dtype: object

In [13]:
ser2[2]

'hasiib'

In [14]:
ser2[1::2]

1    nandu
3     anil
dtype: object

In [15]:
ser2[::2]

0    sabeeda
2     hasiib
dtype: object

In [16]:
ser2[1:2]

1    nandu
dtype: object

In [17]:
ser4=pd.Series(list2,index=["a","b","c","d"])

In [18]:
ser4

a    sabeeda
b      nandu
c     hasiib
d       anil
dtype: object

In [19]:
ser4["c"]

'hasiib'

In [20]:
ser3

0      1
1      6
2     11
3     16
4     21
5     26
6     31
7     36
8     41
9     46
10    51
11    56
12    61
13    66
14    71
15    76
16    81
17    86
18    91
19    96
dtype: int32

In [21]:
ser3>20

0     False
1     False
2     False
3     False
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
dtype: bool

In [22]:
ser3[ser3>30]

6     31
7     36
8     41
9     46
10    51
11    56
12    61
13    66
14    71
15    76
16    81
17    86
18    91
19    96
dtype: int32

In [23]:
(ser3>30) & (ser3<60)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool

In [24]:
ser3[(ser3>30) & (ser3<60)]

6     31
7     36
8     41
9     46
10    51
11    56
dtype: int32

In [25]:
ser3.min()

1

In [26]:
ser3.max()

96

In [27]:
ser3+10

0      11
1      16
2      21
3      26
4      31
5      36
6      41
7      46
8      51
9      56
10     61
11     66
12     71
13     76
14     81
15     86
16     91
17     96
18    101
19    106
dtype: int32

In [28]:
ser3-5

0     -4
1      1
2      6
3     11
4     16
5     21
6     26
7     31
8     36
9     41
10    46
11    51
12    56
13    61
14    66
15    71
16    76
17    81
18    86
19    91
dtype: int32

In [29]:
ser3*2

0       2
1      12
2      22
3      32
4      42
5      52
6      62
7      72
8      82
9      92
10    102
11    112
12    122
13    132
14    142
15    152
16    162
17    172
18    182
19    192
dtype: int32

In [30]:
num={"sabi":7,"nandu":29,"hasib":31}

In [31]:
marks=pd.Series(num)

In [32]:
marks

sabi      7
nandu    29
hasib    31
dtype: int64

In [33]:
list2=["sabir","sabi","nandu","nandana","hasib","anil","x"]

In [34]:
marks1=pd.Series(num,index=list2)

In [35]:
marks1

sabir       NaN
sabi        7.0
nandu      29.0
nandana     NaN
hasib      31.0
anil        NaN
x           NaN
dtype: float64

In [36]:
marks1.isna()

sabir       True
sabi       False
nandu      False
nandana     True
hasib      False
anil        True
x           True
dtype: bool

In [37]:
marks1[marks1.isna()]

sabir     NaN
nandana   NaN
anil      NaN
x         NaN
dtype: float64

In [38]:
marks1.isnull()

sabir       True
sabi       False
nandu      False
nandana     True
hasib      False
anil        True
x           True
dtype: bool

In [39]:
marks1[marks1.isnull()]

sabir     NaN
nandana   NaN
anil      NaN
x         NaN
dtype: float64

In [40]:
marks1.notna()

sabir      False
sabi        True
nandu       True
nandana    False
hasib       True
anil       False
x          False
dtype: bool

In [41]:
marks1[marks1.notna()]

sabi      7.0
nandu    29.0
hasib    31.0
dtype: float64

In [42]:
dic={"name":["sabi","nandu","hasib","anil"],"age":[22,24,19,20],"mark1":[90,44,55,58],"mark2":[55,44,88,77]}

In [43]:
mark=pd.DataFrame(dic)

In [44]:
mark

    name  age  mark1  mark2
0   sabi   22     90     55
1  nandu   24     44     44
2  hasib   19     55     88
3   anil   20     58     77

In [45]:
mark["name"]

0     sabi
1    nandu
2    hasib
3     anil
Name: name, dtype: object

In [46]:
mark.head(3)

    name  age  mark1  mark2
0   sabi   22     90     55
1  nandu   24     44     44
2  hasib   19     55     88

In [47]:
mark.tail(2)

    name  age  mark1  mark2
2  hasib   19     55     88
3   anil   20     58     77

In [48]:
mark["age"]>20

0     True
1     True
2    False
3    False
Name: age, dtype: bool

In [49]:
mark[mark["age"]>20]

    name  age  mark1  mark2
0   sabi   22     90     55
1  nandu   24     44     44

In [50]:
mark[mark["name"]=="anil"]

   name  age  mark1  mark2
3  anil   20     58     77

In [51]:
marksheet=pd.DataFrame(dic,columns=["name","age","mark1","mark2","place"])

In [52]:
marksheet

    name  age  mark1  mark2 place
0   sabi   22     90     55   NaN
1  nandu   24     44     44   NaN
2  hasib   19     55     88   NaN
3   anil   20     58     77   NaN

In [53]:
marksheet["place"]=["malappuram","pmna","calicut","kottakal"]

In [54]:
marksheet

    name  age  mark1  mark2       place
0   sabi   22     90     55  malappuram
1  nandu   24     44     44        pmna
2  hasib   19     55     88     calicut
3   anil   20     58     77    kottakal

In [55]:
marksheet["cgpa"]=[9,8,7,6]

In [56]:
marksheet

    name  age  mark1  mark2       place  cgpa
0   sabi   22     90     55  malappuram     9
1  nandu   24     44     44        pmna     8
2  hasib   19     55     88     calicut     7
3   anil   20     58     77    kottakal     6

In [57]:
marksheet["percentage"]=marksheet["cgpa"]*10

In [58]:
marksheet

    name  age  mark1  mark2       place  cgpa  percentage
0   sabi   22     90     55  malappuram     9          90
1  nandu   24     44     44        pmna     8          80
2  hasib   19     55     88     calicut     7          70
3   anil   20     58     77    kottakal     6          60

In [59]:
marksheet["totel marks"]=marksheet["mark1"]+marksheet["mark2"]

In [60]:
marksheet

    name  age  mark1  mark2       place  cgpa  percentage  totel marks
0   sabi   22     90     55  malappuram     9          90          145
1  nandu   24     44     44        pmna     8          80           88
2  hasib   19     55     88     calicut     7          70          143
3   anil   20     58     77    kottakal     6          60          135

In [61]:
marksheet={"Name":["David","Richard","John","Tony","Scott"],"Maths":[85,91,81,84,71],"Science":[87,81,86,86,79],"English":[88,78,88,87,82],"Physics":[92,71,84,82,88],"GenaralKnowedge":[88,74,92,81,89]}

In [62]:
mark=pd.DataFrame(marksheet)

In [63]:
mark

      Name  Maths  Science  English  Physics  GenaralKnowedge
0    David     85       87       88       92               88
1  Richard     91       81       78       71               74
2     John     81       86       88       84               92
3     Tony     84       86       87       82               81
4    Scott     71       79       82       88               89

In [64]:
mark["Totalmark"]=mark["Maths"]+mark["Science"]+mark["English"]+mark["Physics"]+mark["GenaralKnowedge"]

In [65]:
mark

      Name  Maths  Science  English  Physics  GenaralKnowedge  Totalmark
0    David     85       87       88       92               88        440
1  Richard     91       81       78       71               74        395
2     John     81       86       88       84               92        431
3     Tony     84       86       87       82               81        420
4    Scott     71       79       82       88               89        409

In [66]:
mark["Avarage"]=mark["Totalmark"]/500

In [67]:
mark

,Name,Maths,Science,English,Physics,GenaralKnowedge,Totalmark,Avarage
0,David,85,87,88,92,88,440,0.880
1,Richard,91,81,78,71,74,395,0.790
2,John,81,86,88,84,92,431,0.862
3,Tony,84,86,87,82,81,420,0.840
4,Scott,71,79,82,88,89,409,0.818

In [68]:
mark["cgpa"]=(mark["Totalmark"]/50)

In [69]:
mark

,Name,Maths,Science,English,Physics,GenaralKnowedge,Totalmark,Avarage,cgpa
0,David,85,87,88,92,88,440,0.880,8.80
1,Richard,91,81,78,71,74,395,0.790,7.90
2,John,81,86,88,84,92,431,0.862,8.62
3,Tony,84,86,87,82,81,420,0.840,8.40
4,Scott,71,79,82,88,89,409,0.818,8.18

In [70]:
mark["percentage"]=mark["Avarage"]*100

In [71]:
mark

,Name,Maths,Science,English,Physics,GenaralKnowedge,Totalmark,Avarage,cgpa,percentage
0,David,85,87,88,92,88,440,0.880,8.80,88.0
1,Richard,91,81,78,71,74,395,0.790,7.90,79.0
2,John,81,86,88,84,92,431,0.862,8.62,86.2
3,Tony,84,86,87,82,81,420,0.840,8.40,84.0
4,Scott,71,79,82,88,89,409,0.818,8.18,81.8

 Reading a file

In [72]:
marksheet1=pd.read_excel(r"C:\Users\admin\Documents\sabeeda\Mrks_data (1).xlsx")

In [73]:
marksheet1

        Name  Age        City Qualification
0       Amal    22     Kannur           PHD
1       Ammu    26       Pmna      Plus two
2       Arya    24   Thrissur        Degree
3    Sreeraj    22  Kozhikode           BBA
4  Arundathi    21        Ekm           BCA
5      Vipin    25    Shornur            BA
6     Nithin    22   Nilambur           Bsc
7      Karun    23  Kozhikode           Bsc

In [74]:
marksheet2=pd.read_excel(r"C:\Users\admin\Documents\sabeeda\Mrks_data (1).xlsx",sheet_name=["DA1","DA2"])

In [75]:
marksheet2

{'DA1':         Name  Age        City Qualification
 0       Amal    22     Kannur           PHD
 1       Ammu    26       Pmna      Plus two
 2       Arya    24   Thrissur        Degree
 3    Sreeraj    22  Kozhikode           BBA
 4  Arundathi    21        Ekm           BCA
 5      Vipin    25    Shornur            BA
 6     Nithin    22   Nilambur           Bsc
 7      Karun    23  Kozhikode           Bsc,
 'DA2':       Name  Age         City Qualification
 0   Anagha    22      Kannur      Plus two
 1     Anil    20  Trivandrum        Degree
 2     Diya    25   Kozhikode           BCA
 3    Deepa    24    Palakkad           BBA
 4   Nalini    23        Pmna           MCA
 5  Adithya    22    Thrissur           PHD}

In [77]:
iris=pd.read_excel(r"C:\Users\admin\Documents\sabeeda\iris (5).xls")

In [78]:
iris

      SL   SW   PL   PW  Classification
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    NaN  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  NaN  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [79]:
iris.head(10)

    SL   SW   PL   PW Classification
0  5.1  3.5  1.4  0.2    Iris-setosa
1  4.9  3.0  1.4  0.2    Iris-setosa
2  NaN  3.2  1.3  0.2    Iris-setosa
3  4.6  3.1  1.5  0.2    Iris-setosa
4  5.0  3.6  1.4  0.2    Iris-setosa
5  5.4  3.9  1.7  0.4    Iris-setosa
6  4.6  3.4  1.4  0.3    Iris-setosa
7  5.0  3.4  1.5  0.2    Iris-setosa
8  4.4  2.9  1.4  0.2    Iris-setosa
9  4.9  3.1  1.5  0.1    Iris-setosa

In [80]:
iris.tail(10)

      SL   SW   PL   PW  Classification
140  6.7  3.1  5.6  2.4  Iris-virginica
141  NaN  3.1  5.1  2.3  Iris-virginica
142  5.8  2.7  5.1  1.9  Iris-virginica
143  6.8  3.2  5.9  2.3  Iris-virginica
144  6.7  3.3  5.7  2.5  Iris-virginica
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  NaN  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [82]:
iris.isna()

        SL     SW     PL     PW  Classification
0    False  False  False  False           False
1    False  False  False  False           False
2     True  False  False  False           False
3    False  False  False  False           False
4    False  False  False  False           False
..     ...    ...    ...    ...             ...
145  False  False  False  False           False
146  False  False  False  False           False
147  False  False   True  False           False
148  False  False  False  False           False
149  False  False  False  False           False

[150 rows x 5 columns]

In [84]:
iris.isna().sum()

SL                7
SW                6
PL                6
PW                0
Classification    0
dtype: int64

In [88]:
iris["SL"].isna()

0      False
1      False
2       True
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: SL, Length: 150, dtype: bool

In [86]:
iris[iris["SL"].isna()]

     SL   SW   PL   PW   Classification
2   NaN  3.2  1.3  0.2      Iris-setosa
21  NaN  3.7  1.5  0.4      Iris-setosa
39  NaN  3.4  1.5  0.2      Iris-setosa
51  NaN  3.2  4.5  1.5  Iris-versicolor
85  NaN  3.4  4.5  1.6  Iris-versicolor
106 NaN  2.5  4.5  1.7   Iris-virginica
141 NaN  3.1  5.1  2.3   Iris-virginica

In [89]:
iris[iris['SW'].isna()]

      SL  SW   PL   PW   Classification
10   5.4 NaN  1.5  0.2      Iris-setosa
27   5.2 NaN  1.5  0.2      Iris-setosa
43   5.0 NaN  1.6  0.6      Iris-setosa
72   6.3 NaN  4.9  1.5  Iris-versicolor
98   5.1 NaN  3.0  1.1  Iris-versicolor
124  6.7 NaN  5.7  2.1   Iris-virginica

In [90]:
iris[iris['PL'].isna()]

      SL   SW  PL   PW   Classification
28   5.2  3.4 NaN  0.2      Iris-setosa
42   4.4  3.2 NaN  0.2      Iris-setosa
56   6.3  3.3 NaN  1.6  Iris-versicolor
94   5.6  2.7 NaN  1.3  Iris-versicolor
109  7.2  3.6 NaN  2.5   Iris-virginica
147  6.5  3.0 NaN  2.0   Iris-virginica